tap "buildpacks/tap"
tap "d12frosted/emacs-plus"
tap "harelba/q"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "jdxcode/tap"
tap "jimeh/emacs-builds"
tap "localstack/tap"
tap "microsoft/mssql-release"
brew "libpng"
brew "xz"
brew "webp"
brew "bash"
brew "freetype"
brew "gettext"
brew "openssl@3"
brew "readline"
brew "libx11"
brew "direnv"
brew "icu4c"
brew "fop"
brew "gd"
brew "gmp"
brew "jj"
brew "libtool"
brew "libxml2"
brew "libxslt"
brew "make"
brew "mise"
brew "pcre"
brew "starship"
brew "tree-sitter"
brew "unixodbc"
brew "wxwidgets"
brew "zsh"
cask "1password-cli"
cask "chatgpt"
cask "firefox"
cask "font-fira-mono-nerd-font"
cask "font-source-code-pro"
cask "google-chrome"
cask "google-earth-pro"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "livebook"
cask "logitech-camera-settings"
cask "logitech-g-hub"
cask "omnidisksweeper"
cask "postgres-unofficial"
cask "raycast"
cask "suspicious-package"
cask "visual-studio-code"
cask "zoom"
