tap "buildpacks/tap"
tap "d12frosted/emacs-plus"
tap "harelba/q"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/command-not-found"
tap "homebrew/services"
tap "jdxcode/tap"
tap "jimeh/emacs-builds"
tap "localstack/tap"
tap "microsoft/mssql-release"
tap "railwaycat/emacsmacport"
brew "libpng"
brew "xz"
brew "webp"
brew "bash"
brew "freetype"
brew "gettext"
brew "openssl@3"
brew "readline"
brew "libx11"
brew "direnv"
brew "icu4c"
brew "fop"
brew "gd"
brew "gmp"
brew "jj"
brew "libtool"
brew "libxml2"
brew "libxslt"
brew "make"
brew "mise"
brew "pcre"
brew "python@3.11"
brew "starship"
brew "tree-sitter"
brew "unixodbc"
brew "wxwidgets"
brew "zsh"
cask "1password-cli"
cask "amazon-workspaces"
cask "chatgpt"
cask "chromedriver"
cask "cleanmymac"
cask "firefox"
cask "font-fira-mono-nerd-font"
cask "font-source-code-pro"
cask "gitkraken"
cask "gitkraken-cli"
cask "google-chrome"
cask "google-earth-pro"
cask "hammerspoon"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "livebook"
cask "logitech-camera-settings"
cask "logitech-firmwareupdatetool"
cask "logitech-g-hub"
cask "microsoft-auto-update"
cask "omnidisksweeper"
cask "postgres-unofficial"
cask "raycast"
cask "sublime-merge"
cask "suspicious-package"
cask "visual-studio-code"
cask "zoom"
vscode "1password.op-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "bbenoist.nix"
vscode "bscan.perlnavigator"
vscode "castwide.solargraph"
vscode "charliermarsh.ruff"
vscode "codezombiech.gitignore"
vscode "eamodio.gitlens"
vscode "elixir-tools.elixir-tools"
vscode "engineernick.uiua-keypad"
vscode "erlang-ls.erlang-ls"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "jakebecker.elixir-ls"
vscode "jnoortheen.nix-ide"
vscode "kahole.magit"
vscode "kdl-org.kdl"
vscode "leanprover.lean4"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mattn.lisp"
vscode "mechatroner.rainbow-csv"
vscode "medo64.render-crlf"
vscode "meta.sapling-scm"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "parallelsdesktop.parallels-desktop"
vscode "pbkit.vscode-pbkit"
vscode "phoenixframework.phoenix"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "timonwong.shellcheck"
vscode "tweag.vscode-nickel"
vscode "uiua-lang.uiua-vscode"
vscode "virgilsisoe.hammerspoon"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
